# Контрольная работа по курсу "Итоги блока. Выбор специализации"

**Данная работа выполнена Дмитрием Герасимчуком**

_Работа выполнена с целью демонстрации полученных знаний и навыков по итогу прохождения первого блока обучения на программе разработчик_

Результаты итоговой работы представляют собой:

1. Созданный репозиторий на портале GitHub. _Подтверждение_: рабочая ссылка на GitHub, которая прикреплена на платформе GeekBrains: https://github.com/DmitryGerasimchuk/FinalTask.git

2. Созданный текстовый файл README.md, содержащий описание работы. В указанном документе написан текст, отражаюший суть представленной контрольной работы. В качестве языка был использован язык разметки Markdown. _Подтверждение_: файл README.md создавался в программе VSCode в начале выполнения проекта.

3. Блок-схема алгоритма решения задачи. _Подтверждение_: для понимания алгоритма работы программы, было принято решение его визуализировать (нарисовать) в специализированной программе **draw.io**.

Блок-схема **Graphic solution** представлена в 2-х форматах: картинки (расширение:png) и формат программы (расширение:drawio).

4. Решение задачи при помощи языка программирования С#:

   Условие задачи:

   "Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа.

   Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами"

   В качестве проверки решения задачи в условии написано:

   ["hello", "2", "world", ":-)"] -> ["2", ":-)"]

   ['1234", "1567", "-2", "computer science"] -> ["-2"]

   ["Russia", "Denmark", "Kazan"] -> []

_Подтверждение_: в связи с тем, что условие задачи содержит ряд допущений, которые разработчик может истолковывать самостоятельно, было принято решение решать задачу максимально просто. Поэтому массив изначально был заполнен данными заказчика по условию задачи.

В связи с чем, задача решалась простым алгоритмом:

- все значения для проверки из ТЗ, внести в первый массив;
- создать пустой массив, длина которого должна равняться суммарному значению элементов для проверки (вдруг, все элементы будут не превышать 3 символа);
- обычным перебором элементов первого массива (с использованием цикла) найти элементы, длина которых не превышает 3 символов;
- записать выявленые элементы во второй массив;
- вывести на экран значения второго массива.

5. Заливка полученного решения задачи заказчика, файла README.md, картинки с блок-схемой решения задачи на портал GitHub при помощи нескольких сохранений (коммитов).

## Вместо заключения

Я очень долго решал данную задачу поскольку не понял задания (оно содержит неконкретные требования). Однако, на лекции рассказывали, что это моя задача учтонять требования. Поэтому, принимая во внимание, что я очень много времени потратил на то, чтобы понять что на самом деле желает заказчик, я принял решение - буду писать самый простой алгоритм: когда изначально в массиве есть данные заказчика.

Буду честен, после того как я несколько раз попытался сам написать код (неуспешные попытки) я заглянул в сеть "Интернет" (не для списывания, а для разбора): нашел кучу идентичных примеров, которые мне показались неинтересными и (самое главное!), которые я (как новичок, у которого пока процесс узнавания идет, а не обучения) не могу написать, поскольку на семинарах мы так не писали.

**Поэтому после разбора чужих кодов, не стал повторять чужое решение**

Кроме того, при решении задачи я заодно протестировал СhatGPT:

- написал запрос (на русском языке "Напиши программу на С#);
- переписал условие задачи;
- получил следующее решение:

```
using System;

class Program
{
    static void Main(string[] args)
    {
        Console.Write("Введите размер массива: ");
        int n = int.Parse(Console.ReadLine());

        string[] arr = new string[n];

        for (int i = 0; i < n; i++)
        {
            Console.Write($"Введите строку {i + 1}: ");
            arr[i] = Console.ReadLine();
        }

        string[] result = GetShortStrings(arr);

        Console.WriteLine("\nРезультат:");
        for (int i = 0; i < result.Length; i++)
        {
            Console.WriteLine(result[i]);
        }

        Console.ReadKey();
    }

    static string[] GetShortStrings(string[] arr)
    {
        int count = 0;
        for (int i = 0; i < arr.Length; i++)
        {
            if (arr[i].Length <= 3)
            {
                count++;
            }
        }

        string[] result = new string[count];
        int index = 0;
        for (int i = 0; i < arr.Length; i++)
        {
            if (arr[i].Length <= 3)
            {
                result[index] = arr[i];
                index++;
            }
        }

        return result;
    }
}
```

- протестировал решение в программе VSCode - она запускается и выдает правильные ответы;
- разобрал ее по строкам и понял, что хотя решение рабочее, однако так я написать не могу, поскольку нас на семинарах учили по-иному как оформлять код, так как использовать методы и иные структуры.

**Как итог**: после очень большого времени по разбору разных вариантов, попытками понять что именно от меня желают получить и как я должен написать контрольную работу, я получил то, что сейчас Вы оцениваете.

В сумме, считаю, что все условия задачи выполнены.

Да, можно было написать код с запросом от пользователя сущностей для проверки, однако, после разбора кода от СhatGPT, мой код будет аналогичным - что является нечестным для процесса обучения.

Да, можно было залить картинку в тело файла README.md, однако, после размышлений, решил оставить ее как отдельный файл.

## Ну и последнее

Хочу сказать спасибо за задание: в процессе решения многое понял.

Спасибо!

С уважением

Дмитрий
